/********************************************************************************/
/*                                                                              */
/*[システム名]    IoT開発演習 有効アドレス解析関数用ヘッダーファイル            */
/*                                                                              */
/*[機能概要]      有効アドレス解析関数用のヘッダーファイル                      */
/*                                                                              */
/*[特記事項]      なし                                                          */
/*                                                                              */
/*[改版履歴]      作成    2022.01.12  **********                                */
/*                                                                              */
/********************************************************************************/ 
#ifndef EA_CHECK_H
#define EA_CHECK_H

/***** インクルード宣言 *****/
#include "comet_define.h"
#include "comet_table.h"
#include "adrmode_check.h"

/***** プロトタイプ宣言 *****/
/*有効アドレス解析関数*/
int ea_check(Ttracetbl *pk_trace, unsigned short *puh_1st_adr);

#endif      /*EA_CHECK_H*/
