/********************************************************************************/
/*                                                                              */
/*[システム名]    IoT開発演習 ADDA語命令関数用ヘッダファイル                    */
/*                                                                              */
/*[機能概要]      ADDA語命令関数用ヘッダファイル                                */
/*                                                                              */
/*[特記事項]      なし                                                          */
/*                                                                              */
/*[改版履歴]      作成    2021.12.22  **********                                */
/*                                                                              */
/********************************************************************************/
#ifndef FNC_ADDA_H
#define FNC_ADDA_H

#include "comet_table.h"
#include "comet_define.h"

/*プロトタイプ宣言*/
int fnc_adda(Ttracetbl *pk_trace, unsigned short *puh_1st_adr);

#endif /*FNC_ADDA_H*/
