/********************************************************************************/
/*                                                                              */
/*[システム名]    IoT開発演習 SLL語命令関数用ヘッダファイル                     */
/*                                                                              */
/*[機能概要]      SLL語命令関数用ヘッダファイル                                 */
/*                                                                              */
/*[特記事項]      なし                                                          */
/*                                                                              */
/*[改版履歴]      作成    2021.12.22  **********                                */
/*                                                                              */
/********************************************************************************/
#ifndef FNC_SLL_H
#define FNC_SLL_H

#include "comet_table.h"
#include "comet_define.h"

/*プロトタイプ宣言*/
int fnc_sll(Ttracetbl *pk_trace, unsigned short *puh_1st_adr);

#endif /*FNC_SLL_H*/
